# Predicting house price

A project to predict the house price in Banglore in India. 
Dataset from : https://www.kaggle.com/amitabhajoy/bengaluru-house-price-data

In [113]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.model_selection import cross_val_score

In [114]:
import warnings
warnings.filterwarnings('ignore')

In [115]:
# load data into a df
df = pd.read_csv('bengaluru_house_prices.csv')
df.head(10)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00
6,Super built-up Area,18-May,Old Airport Road,4 BHK,Jaades,2732,4.0,NaN,204.00
7,Super built-up Area,Ready To Move,Rajaji Nagar,4 BHK,Brway G,3300,4.0,NaN,600.00
8,Super built-up Area,Ready To Move,Marathahalli,3 BHK,NaN,1310,3.0,1.0,63.25
9,Plot Area,Ready To Move,Gandhi Bazar,6 Bedroom,NaN,1020,6.0,NaN,370.00

In [116]:
df.shape

(13320, 9)

In [117]:
df.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [118]:
df['area_type'].value_counts()

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64

In [119]:
# drop cols
df.drop(['area_type', 'availability', 'society', 'balcony'], axis="columns", inplace=True)
df.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

### Handle NaN value

In [120]:
df.shape

(13320, 5)

In [121]:
df.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [122]:
# drop na cols
df1 = df.dropna()
df1.shape

(13246, 5)

In [123]:
df1.isna().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

### Feature engineering

***Add a col 'bedroom' instead of 'size' col***

In [124]:
df1['size'].value_counts()

2 BHK         5198
3 BHK         4286
4 Bedroom      818
4 BHK          577
3 Bedroom      546
1 BHK          531
2 Bedroom      329
5 Bedroom      296
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           57
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 Bedroom       2
11 BHK           2
10 BHK           2
18 Bedroom       1
43 Bedroom       1
16 BHK           1
14 BHK           1
19 BHK           1
27 BHK           1
13 BHK           1
12 Bedroom       1
Name: size, dtype: int64

In [125]:
# split with space and take the first index for bedroom
df1['bedroom'] = df1['size'].apply(lambda x: int(x.split(' ')[0]) )
df1['bedroom'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [126]:
# drop size col
df2 = df1.drop(['size'], axis="columns")
df2.head()

                   location total_sqft  bath   price  bedroom
0  Electronic City Phase II       1056   2.0   39.07        2
1          Chikka Tirupathi       2600   5.0  120.00        4
2               Uttarahalli       1440   2.0   62.00        3
3        Lingadheeranahalli       1521   3.0   95.00        3
4                  Kothanur       1200   2.0   51.00        2

***Explore total_sqft col***

In [127]:
# method to detect float values -> to find non-float formats
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [128]:
diff_format_total_sqft =  df2[~df2['total_sqft'].apply(is_float)]
diff_format_total_sqft.head(10)

               location      total_sqft  bath    price  bedroom
30            Yelahanka     2100 - 2850   4.0  186.000        4
122              Hebbal     3067 - 8156   4.0  477.000        4
137  8th Phase JP Nagar     1042 - 1105   2.0   54.005        2
165            Sarjapur     1145 - 1340   2.0   43.490        2
188            KR Puram     1015 - 1540   2.0   56.800        2
410             Kengeri  34.46Sq. Meter   1.0   18.500        1
549         Hennur Road     1195 - 1440   2.0   63.770        2
648             Arekere       4125Perch   9.0  265.000        9
661           Yelahanka     1120 - 1145   2.0   48.130        2
672        Bettahalsoor     3090 - 5002   4.0  445.000        4

In [129]:
len(diff_format_total_sqft)

190

In [165]:
# method to convert total_sqft into same format
def convert_sqft_to_num(x):
    tokens = x.split('-')
    if len(tokens) == 2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [166]:
df3 =df2.copy()
df3.total_sqft = df3.total_sqft.apply(convert_sqft_to_num) # convert the col to float
df3 = df3[df3.total_sqft.notnull()] # to remove null values (null total_sqft)
df3.head()

                   location  total_sqft  bath   price  bedroom
0  Electronic City Phase II      1056.0   2.0   39.07        2
1          Chikka Tirupathi      2600.0   5.0  120.00        4
2               Uttarahalli      1440.0   2.0   62.00        3
3        Lingadheeranahalli      1521.0   3.0   95.00        3
4                  Kothanur      1200.0   2.0   51.00        2

In [168]:
df3.isnull().sum()

location      0
total_sqft    0
bath          0
price         0
bedroom       0
dtype: int64

In [169]:
df3.loc[30] # has changed into avg

location      Yelahanka
total_sqft       2475.0
bath                4.0
price             186.0
bedroom               4
Name: 30, dtype: object

In [170]:
# check for different format in 'bath'
len(df3[~df3['bath'].apply(is_float)])

0

In [171]:
# check for different format in 'price'
len(df3[~df3['price'].apply(is_float)])

0

***Add a new feature 'price_per_sqft'***

In [172]:
df4 = df3.copy()
df4['price_per_sqft'] = df4.price*100000/df4.total_sqft
df4.head()

                   location  total_sqft  bath   price  bedroom  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07        2     3699.810606
1          Chikka Tirupathi      2600.0   5.0  120.00        4     4615.384615
2               Uttarahalli      1440.0   2.0   62.00        3     4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00        3     6245.890861
4                  Kothanur      1200.0   2.0   51.00        2     4250.000000

In [173]:
df4.to_csv('price_per_sqft.csv', index=False)

***Explore location***

In [174]:
df4.shape

(13200, 6)

In [176]:
df4.location = df4.location.apply(lambda x: x.strip())

# no of unique locations
len(df4.location.value_counts())

1287

In [181]:
loc_stat = df4.location.value_counts(ascending=False)
loc_stat

Whitefield            533
Sarjapur  Road        392
Electronic City       304
Kanakpura Road        264
Thanisandra           235
                     ...
Srigandada Kaval        1
Dwaraka Nagar           1
Jaymahal Road           1
Jaladarsini Layout      1
Tharabanahalli          1
Name: location, Length: 1287, dtype: int64

In [184]:
loc_less_than_10 = loc_stat[loc_stat <= 10]
loc_less_than_10

Dairy Circle            10
Nagappa Reddy Layout    10
Gunjur Palya            10
Thyagaraja Nagar        10
Nagadevanahalli         10
                        ..
Srigandada Kaval         1
Dwaraka Nagar            1
Jaymahal Road            1
Jaladarsini Layout       1
Tharabanahalli           1
Name: location, Length: 1047, dtype: int64

In [185]:
len(loc_less_than_10)

1047

In [189]:
# location less than 10 -> 'other'
df4.location = df4.location.apply(lambda x: 'other' if x in loc_less_than_10
                                 else x)
len(df4.location.unique())

241

In [191]:
df4.head(10)

                   location  total_sqft  bath   price  bedroom  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07        2     3699.810606
1          Chikka Tirupathi      2600.0   5.0  120.00        4     4615.384615
2               Uttarahalli      1440.0   2.0   62.00        3     4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00        3     6245.890861
4                  Kothanur      1200.0   2.0   51.00        2     4250.000000
5                Whitefield      1170.0   2.0   38.00        2     3247.863248
6          Old Airport Road      2732.0   4.0  204.00        4     7467.057101
7              Rajaji Nagar      3300.0   4.0  600.00        4    18181.818182
8              Marathahalli      1310.0   3.0   63.25        3     4828.244275
9                     other      1020.0   6.0  370.00        6    36274.509804

### Outlier removing